In [ ]:
import pandas as pd

In [ ]:
for i in range(43):
    j = i + 1
    origin = f'dados_21/microdados2021_arq{j}.txt'
    destine = f'dados_21csv/arq{j}.csv'
    file = pd.read_csv(origin, sep=';')
    file.to_csv(destine, index = None)

In [ ]:
arq1 = pd.read_csv('dados_21_csv/arq1.csv')
arq2 = pd.read_csv('dados_21_csv/arq2.csv')
arq3 = pd.read_csv('dados_21_csv/arq3.csv')

In [23]:
arq1

,NU_ANO,CO_CURSO,CO_IES,CO_CATEGAD,CO_ORGACAD,CO_GRUPO,CO_MODALIDADE,CO_MUNIC_CURSO,CO_UF_CURSO,CO_REGIAO_CURSO
0,2021,6,1,1,10028,2001,1,5103403,51,5
1,2021,6,1,1,10028,2001,1,5103403,51,5
2,2021,6,1,1,10028,2001,1,5103403,51,5
3,2021,6,1,1,10028,2001,1,5103403,51,5
4,2021,6,1,1,10028,2001,1,5103403,51,5
...,...,...,...,...,...,...,...,...,...,...
489861,2021,5001459,3996,5,10022,72,1,2611606,26,2
489862,2021,5001459,3996,5,10022,72,1,2611606,26,2
489863,2021,5001459,3996,5,10022,72,1,2611606,26,2
489864,2021,5001459,3996,5,10022,72,1,2611606,26,2
489865,2021,5001487,3948,5,10022,72,1,4209102,42,4

In [24]:
arq2

        NU_ANO  CO_CURSO  ANO_FIM_EM  ANO_IN_GRAD  CO_TURNO_GRADUACAO
0         2021    117588      1111.0       2018.0                 4.0
1         2021   1258528      1111.0       2019.0                 4.0
2         2021    109692      1111.0       2017.0                 4.0
3         2021   1279591      1111.0       2018.0                 4.0
4         2021    117588      1111.0       2020.0                 4.0
...        ...       ...         ...          ...                 ...
489861    2021      6102         NaN          NaN                 NaN
489862    2021   1425255         NaN          NaN                 NaN
489863    2021   1520497         NaN          NaN                 NaN
489864    2021     81230         NaN          NaN                 NaN
489865    2021    108230         NaN          NaN                 NaN

[489866 rows x 5 columns]

In [22]:
arq2.head(8)

   NU_ANO  CO_CURSO  ANO_FIM_EM  ANO_IN_GRAD  CO_TURNO_GRADUACAO
0    2021    117588      1111.0       2018.0                 4.0
1    2021   1258528      1111.0       2019.0                 4.0
2    2021    109692      1111.0       2017.0                 4.0
3    2021   1279591      1111.0       2018.0                 4.0
4    2021    117588      1111.0       2020.0                 4.0
5    2021    103338      1111.0       2020.0                 4.0
6    2021   1258528      1111.0       2021.0                 4.0
7    2021   1258528      1111.0       2019.0                 4.0

In [ ]:
arq3.head(8)

In [17]:
cursosComputacao = arq1[arq1["CO_GRUPO"].isin([72, 4004, 6409, 4005, 79, 4006])]

In [18]:
Atrem1 = cursosComputacao[['NU_ANO','CO_CURSO','CO_GRUPO', 'CO_UF_CURSO', 'CO_REGIAO_CURSO', 'CO_CATEGAD', 'CO_ORGACAD']]

In [21]:
Atrem1

,NU_ANO,CO_CURSO,CO_GRUPO,CO_UF_CURSO,CO_REGIAO_CURSO,CO_CATEGAD,CO_ORGACAD
215,2021,36,4004,51,5,1,10028
216,2021,36,4004,51,5,1,10028
217,2021,36,4004,51,5,1,10028
218,2021,36,4004,51,5,1,10028
219,2021,36,4004,51,5,1,10028
...,...,...,...,...,...,...,...
489861,2021,5001459,72,26,2,5,10022
489862,2021,5001459,72,26,2,5,10022
489863,2021,5001459,72,26,2,5,10022
489864,2021,5001459,72,26,2,5,10022
489865,2021,5001487,72,42,4,5,10022

In [19]:
result = pd.merge(Atrem1, arq2, how="left", on=["NU_ANO", "CO_CURSO"])

In [20]:
result

,NU_ANO,CO_CURSO,CO_GRUPO,CO_UF_CURSO,CO_REGIAO_CURSO,CO_CATEGAD,CO_ORGACAD,ANO_FIM_EM,ANO_IN_GRAD,CO_TURNO_GRADUACAO
0,2021,36,4004,51,5,1,10028,2013.0,2014.0,3.0
1,2021,36,4004,51,5,1,10028,2014.0,2015.0,3.0
2,2021,36,4004,51,5,1,10028,2014.0,2015.0,3.0
3,2021,36,4004,51,5,1,10028,2014.0,2015.0,3.0
4,2021,36,4004,51,5,1,10028,2014.0,2015.0,3.0
...,...,...,...,...,...,...,...,...,...,...
13935670,2021,5001459,72,26,2,5,10022,2018.0,2019.0,1.0
13935671,2021,5001459,72,26,2,5,10022,2018.0,2020.0,4.0
13935672,2021,5001459,72,26,2,5,10022,2018.0,2019.0,4.0
13935673,2021,5001459,72,26,2,5,10022,2019.0,2019.0,4.0
13935674,2021,5001487,72,42,4,5,10022,NaN,NaN,NaN